export default function RefundPage() {
  return (
    <div className='container mx-auto my-8'>
      <div className='my-4 mx-4 sm:mx-0'>
        <h1 className='text-center text-2xl mb-10 md:text-4xl md:mb-16 uppercase'>Возврат</h1>
        <h2 className='text-xl font-bold mt-6'>Возврат товара надлежащего качества *</h2>
        <p className='mt-4'>Товар не был в употреблении, сохранены его потребительские свойства, товарный вид, упаковка
          и документация.
        </p>
        <p className='mt-3'>
          Товар, приобретенный как в розничных салонах, так и интернет-магазине, можно вернуть в течение 14 дней с
          момента покупки.
        </p>
        <p className='mt-3'>
          Возврат осуществляется путем доставки в главный магазин компании.
        </p>
        <p className='mt-3'>
          При обмене или возврате товара у вас должен быть полный комплект товара, паспорт и заявление на возврат.
        </p>
        <p className='mt-3'>
          * Мы не принимаем часы с потертостями, царапинами или другими внешними дефектами.
        </p>
        <h2 className='text-xl font-bold mt-10'>Возврат товара ненадлежащего качества (брак, дефекты, поломка)</h2>
        <p className='mt-4'>В случае поломки, дефекта, брака вы можете вернуть товар в соответствии с законом «О защите
          прав потребителей». Возврат товара, приобретенного в нашем интернет-магазине или нашего
          розничного магазина, осуществляется по адресу розничного магазина.
        </p>
        <p className='mt-3'>
          Чтобы вернуть товар, свяжитесь с нашими менеджерами и сообщите им о своем решении вернуть товар.
        </p>
        <p className='mt-3'>
          В течение гарантийного срока обмен или возврат денег за приобретенные в нашем магазине товары осуществляется
          во всех случаях, подпадающих под закон «О защите прав потребителей».
        </p>
        <p className='mt-3'>
          Заявления на возврат, обмен рассматриваются в течение 10 календарных дней со дня обращения по электронному
          адресу back@bstarco.com.
        </p>
        <p className='mt-3'>
          В течение этого срока вам будет предложено осуществить диагностику дефекта самостоятельно в сервисном центре,
          либо выслать часы нам для последующей передачи в сервисный центр, если в вашем городе нет специализированного
          сервиса. Кроме того, часы возможно сдать на диагностику в нашем розничном магазине. Диагностика изделия
          сервисным центром происходит в среднем 14 календарных дней.
        </p>
        <p className='mt-3'>
          В случае, если сервисный центр заявленный дефект отнес к заводскому браку, мы вернем стоимости товара или
          заменим его на товар этой же марки (модели, артикула) или на такой же товар другой марки (модели, артикула) с
          соответствующим перерасчетом цены с учетом потраченных вами денег за пересылку.
        </p>
        <p className='mt-3'>
          Если заявленный дефект не
          будет подтвержден как заводской брак, а имеет место неправильная эксплуатация изделия, наш менеджер или
          менеджер сервисного центра свяжется с вами и сообщит стоимость ремонта, после чего вы примите решение о
          дальнейших действиях. В этом случае сумма потраченных вами денег за пересылку не возмещается!
        </p>
        <p className='mt-3'>
          Кроме того, возврат и обмен часов возможен, если: – сервис-центр пытается починить ваши часы в течение 45
          дней, но в итоге выдает официальное заключение, что это сделать невозможно; – в течение каждого года
          гарантийного срока часы неоднократно попадали в сервисный центр и находились там в совокупности не менее 30
          дней, и у вас есть соответствующие записи в гарантийном талоне.
        </p>
        <p className='mt-3'>
          Более подробную информацию об условиях гарантии и эксплуатации изделия вы найдете в гарантийном талоне товара.
        </p>
        <p className='mt-3'>
          Обратите внимание, что любые вопросы по возврату и обмену товара ненадлежащего качества мы решаем ТОЛЬКО при
          наличии официального заключения гарантийного сервисного центра.
        </p>
      </div>
    </div>
  );
};
