export default function PrivacyPage() {
  return (
    <div className='container mx-auto my-8'>
      <div className='my-4 mx-4 sm:mx-0'>
        <h1 className='text-center text-2xl mb-10 md:text-4xl md:mb-16 uppercase'>ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</h1>
        <div className='mt-6'>
          <h2 className='text-xl font-bold'>1. Общая информация о сборе персональных данных</h2>
          <p className='mt-6'>Компания «Бишкек Стар» (далее «BS Compnay») очень серьезно относится к защите Ваших
            персональных данных. Настоящая Политика конфиденциальности данных описывает, как компания BS (далее «мы»,
            «нас» и «наш») использует и защищает данные, собранные через сайт shopcasio.bstarco.kg (далее «веб-сайт
            BS»).
          </p>
          <p className='mt-3'>
            Личными данными являются все данные, которые могут иметь отношение к Вам лично, например, ваше имя, ваш
            адрес,
            адрес электронной почты, номер телефона, банковские реквизиты, номера кредитной карты, IP-адрес и т.д.
          </p>
          <p className='mt-3'>Ваши персональные данные собираются и обрабатываются нами только в соответствии с
            положениями Положения о
            защите данных Кыргызской Республики и другими положениями действующего национального законодательства о
            защите
            данных.
          </p>
          <p className='mt-3'>Сбор и обработка персональных данных осуществляется на регулярной основе только с Вашего
            согласия или если обработка таких данных разрешена положениями законодательства. Следующие положения
            предоставляют Вам информацию о характере, объеме и цели сбора и обработки Ваших персональных данных.
          </p>
          <p className='mt-3'>Если для выполнения отдельных функций нашего предложения и/или наших услуг мы обращаемся к
            уполномоченным поставщикам услуг или используем ваши данные в рекламных или аналитических целях, то ниже мы
            дополнительно предоставляем вам подробную информацию о соответствующих процедурах. На этом этапе мы также
            информируем Вас об определенных критериях и сроках хранения. Кроме того, мы информируем Вас о Ваших правах в
            отношении каждого случая обработки данных.
          </p>
          <p className='mt-3'>Настоящая Политика конфиденциальности относится исключительно к нашему сайту. В случае,
            если
            вы переходите по
            ссылкам с нашего сайта на сайты третьих лиц, пожалуйста, обратитесь к этим сайтам за информацией о том, как
            они обращаются с вашими данными.</p>
        </div>
        <div className='mt-6'>
          <h2 className='text-xl font-bold mt-6'>2. Контакты</h2>
          <p className='mt-3'>Если у Вас возникли вопросы, предложения или критика в отношении защиты данных нашего
            веб-сайта, пожалуйста,
            свяжитесь с нами:
          </p>
          <p className='font-light italic mt-2'>
            ОсОО «Бишкек Стар Компани»
            <br/>
            Магазин часов Casio в ТЦ EURASIA
            <br/>
            Киевская 62, Бишкек, Кыргызстан
            <br/>
            с 10:00 до 21:00 без выходных
          </p>
        </div>
        <div className='mt-6'>
          <h2 className='text-xl font-bold'>3. Ваши права</h2>
          <p className='mt-3 font-bold'>Как субъект данных, Вы можете иметь следующие права в отношении компании BS. Для
            осуществления Ваших прав,
            пожалуйста, свяжитесь с нами, как указано в Разделе 2.</p>
          <div className='mt-4'>
            <p className='font-bold mb-2'>
              1. Право доступа в отношении обработки.
            </p>
            <p>Вы можете в рамках закона запросить у нас информацию о том, обрабатываются ли нами личные данные. В этом
              случае вы имеете право запросить информацию о степени обработки данных. Информация о доступе включает в
              себя, в частности, цели обработки, категории соответствующих персональных данных, а также получателей или
              категории получателей, которым были или будут переданы персональные данные. Вы можете иметь право на
              получение копии персональных данных, подвергающихся обработке. Однако это не является абсолютным правом, и
              интересы других лиц могут ограничить ваше право на получение такой копии.</p>
          </div>
          <div className='mt-4'>
            <p className='font-bold mb-2'>
              2. Право на исправление («Право быть забытым»).
            </p>
            <p>Вы можете иметь право на исправление Ваших данных компанией BS, если обработанные персональные
              данные, касающиеся Вас, являются неверными. В зависимости от целей обработки вы можете иметь право на
              заполнение неполных личных данных, в том числе путем предоставления дополнительного заявления.</p>
          </div>
          <div className='mt-4'>
            <p className='font-bold mb-2'>
              3. Право на ограничение обработки.
            </p>
            <p>Если для этого существуют предпосылки, Вы можете запросить ограничение на обработку Ваших персональных
              данных. В этом случае соответствующие данные будут помечены и могут быть обработаны нами только для
              определенных целей.</p>
          </div>
          <div className='mt-4'>
            <p className='font-bold mb-2'>
              4. Право на удаление.
            </p>
            <p>При определенных обстоятельствах вы можете иметь право на получение от нас разрешения на стирание личных
              данных, касающихся вас, и мы можем быть обязаны удалить такие личные данные. Такое право на стирание, не
              применяется, если в случае неавтоматизированной обработки стирание было бы невозможно или потребовало бы
              несоразмерных усилий в связи с конкретным режимом хранения и если Ваш интерес к стиранию можно считать
              минимальным. В таком случае вы можете иметь право на ограничение обработки.</p>
          </div>
          <div className='mt-4'>
            <p className='font-bold mb-2'>
              5. Право на возражение.
            </p>
            <p>Вы имеете право в любое время по причинам, вытекающим из Вашей конкретной ситуации, подать протест против
              обработки касающихся Вас персональных данных. Следствием Вашего возражения является то, что компания BS
              больше не будет обрабатывать Ваши персональные данные, если она не сможет доказать веские причины,
              заслуживающие защиты при обработке, которые преобладают над Вашими интересами, правами и свободами, или
              если обработка служит для предъявления, осуществления или защиты юридических претензий. В случае, если мы
              осуществляем маркетинг в отношении Вас, Вы имеете право в любое время подать протест против обработки
              Ваших персональных данных в таких рекламных целях. Вы можете сообщить нам о своем возражении, используя
              следующие контактные данные:</p>
          </div>
        </div>
      </div>
    </div>
  );
};
