export default function TermsPage() {
  return (
    <div className='container mx-auto my-8'>
      <div className='my-4 mx-4 sm:mx-0'>
        <h1 className='text-center text-2xl mb-10 md:text-4xl md:mb-16 uppercase'>Пользовательское соглашение</h1>
        <div className='mt-6'>
          <h2 className='text-xl font-bold'>1. Общая информация</h2>
          <p className='mt-6'>1. Настоящее Пользовательское соглашение (далее – Соглашение) относится к сайту
            «shopcasio.bstarco.kg», расположенному по адресу https://shopcasio.bstarco.kg, а также ко всем его алиасам и
            поддоменам.
          </p>
          <p className='mt-3'>
            2. Настоящее Соглашение регулирует отношения между администрацией сайта (далее – Администрация) и
            пользователем данного сайта.
          </p>
          <p className='mt-3'>3. Администрация сайта оставляет за собой право в любое время изменять, добавлять или
            удалять пункты настоящего Соглашения без уведомления Пользователя.
          </p>
          <p className='mt-3'>4. Использование сайта пользователем означает принятие Соглашения и изменений, внесенных в
            настоящее Соглашение.
          </p>
          <p className='mt-3'>5. Пользователь несет персональную ответственность за проверку настоящего Соглашения на
            наличие изменений в нем.
          </p>
        </div>
        <div className='mt-6'>
          <h2 className='text-xl font-bold mt-6'>2. Определение терминов</h2>
          <p className='mt-3'>2.1. Перечисленные ниже термины имеют для целей настоящего Соглашения следующее значение:
          </p>
          <p className='mt-3'>2.1.1. «shopcasio.bstarco.kg» – Интернет-ресурс, расположенный на доменном имени
            https://shopcasio.bstarco.kg/, осуществляющий свою деятельность посредством Интернет-ресурса и сопутствующих
            ему сервисов (далее — Сайт).
          </p>
          <p className='mt-3'>2.1.2. «shopcasio.bstarco.kg» – сайт, содержащий информацию о Товарах и/или Услугах и/или
            Иных ценностях для пользователя, Продавце и/или Исполнителе услуг, позволяющий осуществить выбор, заказ и
            (или) приобретение Товара, и/или получение услуги.
          </p>
          <p className='mt-3'>2.1.3. Администрация сайта – уполномоченные сотрудники на управление Сайтом, действующие
            от имени компании Bishkek Star Company.
          </p>
          <p className='mt-3'>2.1.4. Пользователь сайта (далее — Пользователь) – лицо, имеющее доступ к Сайту,
            посредством сети Интернет и использующее Сайт.
          </p>
          <p className='mt-3'>2.1.5. Содержание сайта (далее – Содержание) — охраняемые результаты интеллектуальной
            деятельности, включая любая предоставленная информация, статьи, заметки, новости, отзывы пользователей,
            тексты визитных карт исполнителей, тексты литературных произведений, их названия, предисловия, аннотации,
            статьи, иллюстрации, обложки, аудио и видео файлы, музыкальные произведения с текстом или без текста,
            графические, текстовые, фотографические, производные, составные и иные произведения, пользовательские
            интерфейсы, визуальные интерфейсы, названия товарных знаков и брендов, логотипы, программы для ЭВМ, базы
            данных, а также дизайн, структура, выбор, координация, внешний вид, общий стиль и расположение данного
            Содержания, входящего в состав Сайта и другие объекты интеллектуальной собственности все вместе и/или по
            отдельности, содержащиеся на Cайте.
          </p>
        </div>
        <div className='mt-6'>
          <h2 className='text-xl font-bold'>3. Предмет соглашения</h2>
          <p className='mt-3'>3.1. Предметом настоящего Соглашения является предоставление Пользователю доступа
            содержащимся на Сайте Товарам и/или оказываемым услугам.
          </p>
          <p className='mt-3'>3.1.1. Сайт предоставляет Пользователю следующие виды услуг (сервисов): доступ к средствам
            поиска и навигации сайта; доступ к информации о Товаре и/или услуге к информации о приобретении Товара на
            платной/бесплатной основе;
          </p>
          <p className='mt-3'>3.1.2. Под действие настоящего Соглашения подпадают все существующие (реально
            функционирующие) на данный момент услуги (сервисы) Сайта, а также любые их последующие модификации и
            появляющиеся в дальнейшем дополнительные услуги (сервисы).
          </p>
          <p className='mt-3'>3.2. Доступ к сайту предоставляется на бесплатной основе.
          </p>
          <p className='mt-3'>3.3. Настоящее Соглашение является публичной офертой. Получая доступ к Сайту Пользователь
            считается присоединившимся к настоящему Соглашению.
          </p>
          <p className='mt-3'>3.4. Использование материалов и сервисов Сайта регулируется нормами действующего
            законодательства Кыргызской Республики, прочих стран и международными правовыми нормами.
          </p>
        </div>
        <div className='mt-6'>
          <h2 className='text-xl font-bold'>4. Использование сайта</h2>
          <p className='mt-3'>4.1. Сайт и Содержание, входящее в состав Сайта, принадлежит и управляется Администрацией
            сайта.
          </p>
          <p className='mt-3'>4.2. Содержание Сайта защищено авторским правом, законодательством о товарных знаках, а
            также другими правами, связанными с интеллектуальной собственностью, и законодательством о недобросовестной
            конкуренции.
          </p>
          <p className='mt-3'>4.3. Настоящее Соглашение распространяет свое действия на все дополнительные положения и
            условия о покупке Товара и/или оказанию услуг, предоставляемых на Сайте.
          </p>
          <p className='mt-3'>4.4. Информация, размещаемая на Сайте не должна истолковываться как изменение настоящего
            Соглашения.
          </p>
          <p className='mt-3'>4.5. Администрация сайта имеет право в любое время без уведомления Пользователя вносить
            изменения в перечень Товаров и услуг, предлагаемых на Сайте, и (или) их цен.
          </p>
        </div>
        <div className='mt-6'>
          <h2 className='text-xl font-bold'>5. Отвественность</h2>
          <p className='mt-3'>5.1. Любые убытки, которые Пользователь может понести в случае умышленного или
            неосторожного нарушения любого положения настоящего Соглашения, а также вследствие несанкционированного
            доступа к коммуникациям другого Пользователя, Администрацией сайта не возмещаются.
          </p>
          <p className='mt-3 font-bold'>5.2. Администрация сайта не несет ответственности за:
          </p>
          <p className='mt-1'>5.2.1. Задержки или сбои в процессе совершения операции, возникшие вследствие
            непреодолимой силы, а также любого случая неполадок в телекоммуникационных, компьютерных, электрических и
            иных смежных системах.
          </p>
          <p className='mt-1'>5.2.2. Действия систем переводов, банков, платежных систем и за задержки, связанные с их
            работой.
          </p>
          <p className='mt-1'>5.2.3 Надлежащее функционирование Сайта, в случае, если Пользователь не имеет необходимых
            технических средств для его использования, а также не несет никаких обязательств по обеспечению
            пользователей такими средствами.
          </p>
        </div>
        <div className='mt-6'>
          <h2 className='text-xl font-bold'>6. Нарушение условий пользовательского соглашения</h2>
          <p className='mt-3'>6.1. Администрация сайта имеет право раскрыть информацию о Пользователе, если действующее
            законодательство Кыргызской Республики требует или разрешает такое раскрытие.
          </p>
          <p className='mt-3'>6.2. Администрация сайта вправе без предварительного уведомления Пользователя прекратить и
            (или) заблокировать доступ к Сайту, если Пользователь нарушил настоящее Соглашение или содержащиеся в иных
            документах условия пользования Сайтом, а также в случае прекращения действия Сайта либо по причине
            технической неполадки или проблемы.
          </p>
          <p className='mt-3'>6.3. Администрация сайта не несет ответственности перед Пользователем или третьими лицами
            за прекращение доступа к Сайту в случае нарушения Пользователем любого положения настоящего Соглашения или
            иного документа, содержащего условия пользования Сайтом.
          </p>
          <p className='mt-3'>6.4. Администрация сайта вправе раскрыть любую собранную о Пользователе данного Сайта
            информацию, если раскрытие необходимо в связи с расследованием или жалобой в отношении неправомерного
            использования Сайта либо для установления (идентификации) Пользователя, который может нарушать или
            вмешиваться в права Администрации сайта или в права других Пользователей Сайта.
          </p>
          <p className='mt-3'>6.5. Администрация сайта имеет право раскрыть любую информацию о Пользователе, которую
            посчитает необходимой для выполнения положений действующего законодательства или судебных решений,
            обеспечения выполнения условий настоящего Соглашения, защиты прав или безопасности организации,
            Пользователей.
          </p>
        </div>
        <div className='mt-6'>
          <h2 className='text-xl font-bold'>7. Разрешение споров</h2>
          <p className='mt-3'>7.1. В случае возникновения любых разногласий или споров между Сторонами настоящего
            Соглашения обязательным условием до обращения в суд является предъявление претензии (письменного предложения
            о добровольном урегулировании спора).
          </p>
          <p className='mt-3'>7.2. Получатель претензии в течение 30 календарных дней со дня ее получения, письменно
            уведомляет заявителя претензии о результатах рассмотрения претензии.
          </p>
          <p className='mt-3'>7.3. При невозможности разрешить спор в добровольном порядке любая из Сторон вправе
            обратиться в суд за защитой своих прав, которые предоставлены им действующим законодательством Кыргызской
            Республики.
          </p>
        </div>
        <div className='mt-6'>
          <h2 className='text-xl font-bold'>8. Дополнительные условия</h2>
          <p className='mt-3'>8.1. Администрация сайта не принимает встречные предложения от Пользователя относительно
            изменений настоящего Пользовательского соглашения.
          </p>
          <p className='mt-3'>8.2. Отзывы Пользователя, размещенные на Сайте, не являются конфиденциальной информацией и
            могут быть использованы Администрацией сайта без ограничений.
          </p>
        </div>
      </div>
    </div>
  );
};
